#IF,ELSE
#and or not
age=4
if age>=15 and age<20:
    print("วัยรุ่น")
elif age>=20 and age<30:
    print("วัยผู้ใหญ่")
elif age>=30:
    print("วัยทำงาน")
else:
    print("วัยเด็ก")

print("จบโปรแกรม")
#--------------------------------------------------------------
#เขียนโปรแกรมหาเลข คู่  / คี่

number=99

if number % 2 == 0: #หาร 2 ลงตัว เช็คว่าเป็นเศษ 0 หรือป่าว
    print(number," เป็นเลขคู่")
else:
    print(number," เป็นเลขคี่")
print("จบโปรแกรม")
#--------------------------------------------------------------
#While Loop
i=1
while i<=3:
    print("hello รอบที่ ",i)
    i=i+1
print("จบโปรแกรม")

#----------------------------------------------------------------
#While Loop
#บวกเลข 1-10
j=1
sum=0
while j<=10:
    sum+=j #sum+=1 คือ 0+1 ,sum+=2 คือ 1+2,.......
    j+=1   #j เริ่ม 1 ครั้งงต่อไป +1 เพิ่มทีละรอบ
print(sum)
print("จบโปรแกรม")

#----------------------------------------------------------------
#For Loop
for a in range(1,5): #(start เริม ,stop สิ้นสุด,step อยากให้เพิ่มขึ้นทีละเท่าไหร่)
    print("รอบที่ ",a)
print("จบโปรแกรม")

#----------------------------------------------------------------
#บวกโดยยใช้ Loop for  1 บวกกันถึง 10
summation=0
for b in range(1,11): #(start เริม ,stop สิ้นสุด,step อยากให้เพิ่มขึ้นทีละเท่าไหร่)
    summation+=b
print("ผลรวม = ",summation)
print("จบโปรแกรม")

#----------------------------------------------------------------
#Loop ซ้อน Loop
o=1
while o<=2:
    print("สูตรคูณแม่ ",o)
    h=1
    while h<=12:
        z=o*h
        print(o," x ",h," = ",z)
        h+=1
    o+=1
print("จบโปรแกรม")

#----------------------------------------------------------------
#การแยกข้อความหรือแยก string ด้วย Split(เครื่องหมายแยกข้อความ)
month_name = 'x มกราคม กุมภาพันธ์ มีนาคม เมษายน พฤษภาคม มิถุนายน กรกฎาคม สิงหาคม กันยายน ตุลาคม พฤศจิกายน ธันวาคม'.split()
print(month_name) 

text = "นก,แมว,หมู"
show=text.split(",")
print(show)

#----------------------------------------------------------------
#การแทรกรูปแบบของการแสดงผลใน String literal ได้ เช่น %s สำหรับการแสดงผล String 
# %f สำหรับการแสดงผล Float และ %d สำหรับการแสดงผล Integer
lang = "Python"
version = 3.6
print("%s language" % lang)
print("Version %f" % version)
print("%d" % 123)
print("%s %f %d" % (lang, version, 123))

#----------------------------------------------------------------
#Array

car = ["BENZ","TOYOTA","BM","HONDA"]
num = len(car)#หาว่ามมีทั้งงหมดกี่ตัวใน Array
print(num)
car[0] = "MAZADA" #ใช้เปลี่ยนข้อมูลของตำแหน่งงนั้น เช่น ตำแหน่ง 0 คือ Benz จะถูกเปลี่ยนเป็น MAZADA
print(car)
select = car[1] #เลือกตำแหน่งที่จะแสดงผล
print(select)



